---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc
source: html/86c3a5ed-8d43-7139-f564-cb6ab74b5054.htm
---
# RebarShapeDefinitionByArc Methods

Specify a parameter to drive the arc length of the shape.